app/controllers/alteracaos_controller.rb

  def alterar_classe

# ALTERAR TAMBÈM AS DATAS NO CRIANCAS def create e no def uppdate   CRIANÇAS.RD
    $nregistros = 0
    @criancas_alteracao = Crianca.find( :all,:conditions => ["status = 'NA_DEMANDA'" ])
    for crianca in @criancas_alteracao
      anterior = crianca.grupo_id
       if (crianca.nascimento < Date.today.to_date and crianca.nascimento >= DATAB1.to_date)
           crianca.grupo_id = 1
       else if(crianca.nascimento < DATAB1.to_date and crianca.nascimento >= DATAB2.to_date)
               crianca.grupo_id = 2
            else if(crianca.nascimento < DATAB2.to_date and crianca.nascimento >= DATAM1A.to_date)
                   crianca.grupo_id = 4
                 else if(crianca.nascimento < DATAM1A.to_date and crianca.nascimento >= DATAM1B.to_date)
                         crianca.grupo_id = 8
                      else if(crianca.nascimento < DATAM1B.to_date and crianca.nascimento >= DATAM2.to_date)
                              crianca.grupo_id = 5
                           else if(crianca.nascimento < DATAM2.to_date and crianca.nascimento >= DATAN1.to_date)
                                   crianca.grupo_id = 6
                                 else if(crianca.nascimento < DATAN1.to_date and crianca.nascimento >= DATAN2.to_date)
                                          crianca.grupo_id = 7
                                     end
                                end
                           end
                        end
                   end
               end
           end
      atual = crianca.grupo_id
      crianca.save
---
SELECT * FROM `criancas` WHERE (status = 'NA_DEMANDA')
UPDATE `criancas` SET `updated_at` = '2016-11-25 12:29:18', `grupo_id` = 5 WHERE `id` = 5202