app/controllers/criancas_controller.rb

  def show
     @crianca = Crianca.find(params[:id])
     @unidade_regiao= Unidade.find(:all , :conditions=>['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)',@crianca.regiao_id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 830)
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 2)
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 77) and (id <> 54)) ORDER BY nome

  def edit


    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 830)

    respond_to do |format|


      if @crianca.save
---
INSERT INTO `criancas` (`transferencia`, `servidor_local`, `nascimento`, `grupo_id`, `responsavel`, `opcao1`, `opcao2`, `opcao3`, `created_at`, `unidade_id`, `numero`, `servidor_publico`, `periodo`, `matriculado`, `responsavel_n`, `fone_trabalho`, `sexo`, `bairro`, `tel1`, `tel2`, `celular`, `irmao`, `obs`, `updated_at`, `endereco`, `trabalho`, `nome`, `regiao_id`, `complemento`, `parentesco`, `mae`, `pai`, `n_especial`, `necessidade`, `nomerecado`, `local_trabalho`, `unidade_i`, `unidade_t`, `status`) VALUES(0, '', '2014-04-24 03:00:00', 4, 0, 'CC ARACY', '', '', '2016-11-25 12:16:00', 7, '', 0, ' ', NULL, '', '', NULL, '', '', '', '', 0, NULL, '2016-11-25 12:17:50', '', 0, 'NAOR TESTE 25/11', 9, '', '', 'TESTETNAOR', '', 0, '', '', '', '', '', 'NA_DEMANDA')

  def update
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 830)



      respond_to do |format|
      if @crianca.update_attributes(params[:crianca])
---
UPDATE `criancas` SET `updated_at` = '2016-12-21 18:47:24', `periodo` = ' ', `unidade_t` = '29' WHERE `id` = 2336

  def create_observacao_crianca
   t=params[:observacao_crianca]
    @observacao_crianca = ObservacaoCrianca.new(params[:observacao_crianca])
      t1=params[:observacao_crianca]
      @crianca = Crianca.find(session[:id_crianca])
      @observacao_crianca.crianca_id =@crianca.id
      @observacao_crianca.data = Time.now
      @observacao_crianca.funcionario = @observacao_crianca.funcionario + '('+ current_user.unidade.nome + ')'

      if @observacao_crianca.save
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 830)
INSERT INTO `observacao_criancas` (`observacao`, `updated_at`, `funcionario`, `crianca_id`, `created_at`, `data`) VALUES('testett asdasdas asd asdf asd aSDADS', '2016-09-02 15:28:04', 'naor', 830, '2016-09-02 15:28:04', '2016-09-02 12:28:04')

  def consultacrianca
     if params[:type_of].to_i == 1
         if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                 @criancas = Crianca.find( :all,:conditions => ["nome like ? AND status = 'NA_DEMANDA' AND recadastrada=1" , "%" + params[:search1].to_s + "%"],:order => 'nome ASC, unidade_id ASC')
              else
                 @criancas = Crianca.find( :all,:conditions => ["nome like ? AND status = 'NA_DEMANDA' AND recadastrada=1 ", "%" + params[:search1].to_s + "%" ],:order => 'nome ASC')
              end
              @canceladas = Crianca.find( :all,:conditions => [" nome like ? AND status =? AND recadastrada=1",  "%" + params[:search1].to_s + "%" , 'CANCELADA'],:order => 'nome ASC')
              @demandas = Crianca.find( :all,:conditions => [" nome like ? and status =? AND recadastrada=1",  "%" + params[:search1].to_s + "%" , 'NA_DEMANDA'],:order => 'nome ASC')
              @matriculadas = Crianca.find( :all,:conditions => [" nome like ? and status =?  AND recadastrada=1",  "%" + params[:search1].to_s + "%" , 'MATRICULADA'],:order => 'nome ASC')
        render :update do |page|
          page.replace_html 'criancas', :partial => "criancas"
        end
     else if params[:type_of].to_i == 2
              if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                 @criancas = Crianca.find( :all,:conditions => ['status = ? AND recadastrada = 1', params[:crianca][:status]],:order => 'nome ASC, unidade_id ASC')
              else
                 @criancas = Crianca.find( :all,:conditions => [" unidade_id = ? and status =? AND recadastrada = 1", current_user.unidade_id , params[:crianca][:status]],:order => 'nome ASC')
---
SELECT * FROM `criancas` WHERE (nome like '%maria %') ORDER BY nome ASC, unidade_id ASC
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 77) and (id <> 54)) ORDER BY nome

def relatorio_geral

#   @regiaos1= Regiao.find(:all, :joins=> 'JOIN criancas on  criancas.regiao_id = regiaos.id', :conditions=>['regiaos.id > 99 AND regiaos.id < 108 AND criancas.recadastrada = 1' ], :order => 'regiaos.nome')
#   @regiaos2= Regiao.find(:all, :joins=> 'JOIN criancas on  criancas.regiao_id = regiaos.id', :conditions=>['regiaos.id > 107 AND regiaos.id < 115 AND criancas.recadastrada = 1' ], :order => 'regiaos.nome')
#   @regiaos3= Regiao.find(:all, :joins=> 'JOIN criancas on  criancas.regiao_id = regiaos.id', :conditions=>['regiaos.id > 114 AND regiaos.id < 201 AND criancas.recadastrada = 1' ], :order => 'regiaos.nome')

   @regiaos1= Regiao.find(:all, :conditions=>['regiaos.id > 99 AND regiaos.id < 108 ' ], :order => 'regiaos.nome')
   @regiaos2= Regiao.find(:all, :conditions=>['regiaos.id > 107 AND regiaos.id < 115 ' ], :order => 'regiaos.nome')
   @regiaos3= Regiao.find(:all, :conditions=>['regiaos.id > 114 AND regiaos.id < 201' ], :order => 'regiaos.nome')


   @criancas = Crianca.find(:all, :conditions => ["status = 'NA_DEMANDA' AND recadastrada = 1" ], :order => 'nome')
---
SELECT id FROM `criancas` WHERE (status = 'NA_DEMANDA' and (grupo_id= 4 or grupo_id = 3) and opcao1 = 'CC ARACY' and vaga = 0)

def relatorio_mae
  @criancas = Crianca.find(:all, :conditions => ["status = 'NA_DEMANDA'" ],:order => 'nome')
  @regiao11 = Regiao.find(:all,  :order => 'nome')
  @unidades11 = Unidade.find(:all, :conditions=> ["nome like? AND ativo = 1 ", "%"+"CC " +"%"], :order => 'nome')
---
SELECT id FROM `criancas` WHERE (status = 'NA_DEMANDA' and (grupo_id= 4 or grupo_id = 3) and opcao1 = 'CONV. ACONCHEGO 1' and trabalho = 1 )
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def mesmo_nome
    session[:nome] = params[:crianca_nome]
    @verifica = Crianca.find_by_nome(session[:nome])
---
SELECT * FROM `criancas` WHERE (`criancas`.`nome` = 'naor teste 25/11') LIMIT 1

  def mesma_mae
     if Crianca.find_by_mae(params[:crianca_mae]) then
---
SELECT * FROM `criancas` WHERE (`criancas`.`mae` = 'testetNAor') LIMIT 1

  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")
---
SELECT * FROM `grupos` WHERE (id <> 3) ORDER BY nome

  def load_unidades
    session[:unidade] = current_user.unidade_id
    if current_user.unidade_id== 53 or current_user.unidade_id==52
       @unidades1 =  Unidade.find(:all,  :conditions => ["(tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) AND ativo = 1" ],:order => "nome")
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (status = 'NA_DEMANDA' AND trabalho = 1 and opcao3='CC ARACY' ) ORDER BY servidor_publico DESC, irmao DESC, transferencia DESC, created_at ASC