app/controllers/roles_users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
SELECT * FROM `roles_users` WHERE (`roles_users`.`id` = 108)
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def load_role
    @roles = Role.find(:all)
    @role_users = RolesUser.find(:all)

UPDATE `roles_users` SET `role_id` = 1 WHERE `id` = 108
---
  def update
    @role_user = RolesUser.find(params[:id])
    @role_user.role_id = $new_role_id
    respond_to do |format|
      if @role_user.update_attributes(params[:role_user])