app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'teste') LIMIT 1
---
  def load_users
    @users =User.find(:all, :order => 'login ASC')

INSERT INTO `users` (`remember_token_expires_at`, `created_at`, `layout`, `password_reset_code`, `email`, `salt`, `unidade_id`, `login`, `remember_token`, `updated_at`, `activation_code`, `activated_at`, `crypted_password`) VALUES(NULL, '2016-11-24 16:30:08', 'application', NULL, 'naor@seducpma.com', 'eddf6abf83828656bc621823b783da7cae68e0e1', 52, 'teste', NULL, '2016-11-24 16:30:08', '73fe2c7072506c3ff1abd7b2bf7cb36446fd1050', '2016-11-24 16:30:08', 'bfebaa2582e8ff5ce7ae913f14e44e768d08108c')
SELECT * FROM `users` ORDER BY login ASC
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?

SELECT * FROM `unidades` ORDER BY nome ASC
---
  def load_resources
    @unidades = Unidade.all